{"date":"17 May 2016","post":"<p>Oi galera, esse post não é pra falar nada específico de alguma tecnologia ou algo do tipo.</p>\n<p>Ele é apenas para compartilhar um pouco sobre o que ta rolando na minha vida, uma experiência nova que estou tendo.</p>\n<p>Vou falar sobre:</p>\n<ul>\n<li>Saída da Huge</li>\n<li>Email do além</li>\n<li>Processo</li>\n<li>Um pouco sobre a Toptal</li>\n</ul>\n<h2>Saída da Huge</h2>\n<p>Eu tive o prazer de trabalhar durante 7 meses com pessoas extraordinárias (no pessoal e profissional).</p>\n<p>Durante os 7 meses, eu vivenciei uma das melhores experiências profissionais que eu tive, principalmente por causa das pessoas, trabalhando diretamente com designers, galera de estratégia e é claro com os devs mais irados que eu já vi.</p>\n<p>Fiz grandes amigos e aprendi muito no período que trabalhei lá.</p>\n<h2>Email do além</h2>\n<p>Um belo dia, jogando o novo Mortal Kombat com um brother (<a href=\"https://twitter.com/Willian_justen\">Willian Justen</a>) quando ainda trabalhavamos juntos na Huge, recebi um email elogiando meu github e perguntando se gostaria de conversar via skype sobre a oportunidade de fazer parte do core team da <a href=\"https://www.toptal.com/\">Toptal</a>.</p>\n<p>Eu pensei...</p>\n<blockquote>\n<p>Bom... será uma experiência irada conversar com essa galera do outro lado do mundo, claro que não passarei no processo, mas vamos ver até onde eu vou.</p>\n</blockquote>\n<p>Eu não tinha nada a perder!</p>\n<p>Foi muito maneiro conversar com a galera, falando com várias pessoas da <a href=\"https://www.toptal.com/\">Toptal</a> ao redor do mundo via skype.\nSó no processo eu conversei com pessoas da Polônia, Sérvia, Rússia e Bulgária.</p>\n<p>Só isso já tinha valido a experiência, porque foram conversas e testes muito legais com pessoas super amigáveis e compreensivas.</p>\n<p>E bom... para minha surpresa, eu passei o.O</p>\n<h2>Processo</h2>\n<p>Quando marcaram a primeira entrevista via skype, eu fiquei preocupado pois não tinha um computador bom e eu não sabia o que viria pela frente.</p>\n<h4>Para que servem os amigos?</h4>\n<p>O Willian emprestou o notebook dele, fui até a casa dele de manhã cedo no horário da entrevista e fiz no computador dele.</p>\n<p>Foi ótimo porque era do lado do trabalho também, então não iria me atrasar.</p>\n<h4>Etapa 1</h4>\n<p>Fiz a primeira entrevista com uma pessoa da Polônia, estava bem nervoso, mas magicamente consegui relaxar bastante e falar pra caramba sobre mim e alguns assuntos técnicos que me perguntaram.</p>\n<p>No final da entrevista fiquei sabendo que tinha passado para a próxima etapa.</p>\n<h4>Etapa 2</h4>\n<p>Nessa etapa eu participei de uma entrevista mais técnica, com conversas sobre tecnologias e experiências e no final um teste com live coding.</p>\n<p>A pessoa me entrevistando era da Sérvia, tinha um conhecimento técnico mais profundo do que na etapa anterior, consegui relaxar e ficar calmo até o final.</p>\n<p>Assim como na etapa anterior me informaram que passei para a próxima.</p>\n<h4>Etapa 3</h4>\n<p>Essa etapa também se tratava de uma entrevista bem técnica, 100% live coding e a pessoa era da Rússia.</p>\n<p>Fiquei bem nervoso mas me deram bastante liberdade na hora do teste, então me concentrei e consegui fazer um código reutilizavel e bem organizado, integrando o código com uma API deles, foi bem bacana.</p>\n<p>No final conversamos bastante sobre a Toptal e seus processos de desenvolvimento, sua arquitetura e etc, foi muito interessante, mas não tive resposta se tinha passado ou não, fui informado que receberia a resposta depois.</p>\n<p>Depois dessa etapa eu estava bem feliz de ter decidido participar do processo e gostei muito de conversar com todos, mas não acreditava que iria passar.</p>\n<h4>Etapa final</h4>\n<p>Depois de um tempo recebi o email com a informação que passei para a última etapa, para conversar com o vice presidente de engenharia da Toptal.</p>\n<p>O cara é incrível, foi uma conversa muito boa, com perguntas casuais, técnicas, discutindo ideias e o cenário de algumas tecnologias.</p>\n<p>No final ele me deixou fazer perguntas também, acreditando que o entrevistado também tem que ter o direito de entrevistar, achei isso muito maneiro, então perguntei como ele chegou onde chegou e outras coisas que foram muito fodas de saber.</p>\n<p>Quando acabou a call, recebi imediatamente depois uma mensagem de outra pessoa encarregada a conversar comigo.</p>\n<p>Nessa conversa foi dada a notícia que eu tinha passado por todas as etapas e que tinham uma oferta para fazer.</p>\n<h2>Um pouco sobre a Toptal</h2>\n<p>A Toptal é uma empresa de São Francisco, porém todos trabalham 100% remoto, isso mesmo, ela não tem um escritório físico para os empregados, seu escritório é o mundo.</p>\n<p>Então atualmente estou como Front-end Developer no Core Team da Toptal, trabalhando remotamente com pessoas que estão ao redor do mundo, de diferentes culturas e as vezes viajando por ai enquanto trabalham.</p>\n<p>Estou gostando demais da experiênica e espero voltar com mais posts sobre os conhecimentos adquiridos nessa jornada.</p>\n<p>E galera, sempre é legal ter experiências novas, eu sai da minha zona de conforto, e estou correndo atrás, acho que isso pode servir de aprendizado pra vocês assim como serviu para mim, experimentem coisas novas mesmo estando confortáveis na situação atual, não precisa necessariamente mudar, no final você quem decide.</p>\n<p>Me desejem sorte :)</p>\n","metaData":{"layout":"post","title":"Mudanças","slug":"mudancas","description":"Novidades e novas experiências de vida","date":"2016-05-17 13:23:43 -0300","language":"Brazilian Portuguese","excerpt":"Este post não é pra falar nada específico de alguma tecnologia ou algo do tipo. \n\nEle é apenas para compartilhar um pouco sobre o que ta rolando na minha vida, uma experiência nova que estou tendo.\n","tags":["life","experience"]},"slug":"mudancas"}